openwch/ch564/EVT/EXAM/USB/DEVICE/SimulateCDC/User/ch564_usbhs_device.c
                /* Set end-point busy */
                USBHS_Endp_Busy[ endp ] |= DEF_UEP_BUSY;
                /* end-point n response tx ack */
                USBHSD_UEP_TLEN( endp ) = len;
                USBHSD_UEP_TXCTRL( endp ) = (USBHSD_UEP_TXCTRL( endp ) &= ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_ACK;
            }
            else
            {
                return 1;
            }
        }
        else
        {
            return 1;
        }
    }
    else
    {
        return 1;
    }

    return 0;
}

/*********************************************************************
 * @fn      USBHS_IRQHandler
 *
 * @brief   This function handles USBHS exception.
 *
 * @return  none
 */
void USBHS_DEV_IRQHandler( void )
{
    uint8_t  intflag, intst, errflag;
    uint16_t len;
    uint8_t endp_num;
    uint32_t baudrate;

    intflag = USBHSD->INT_FG;
    intst = USBHSD->INT_ST;

    if( intflag & RTX_ACT_IF )
    {
        endp_num = intst & RB_UIS_EP_ID_MASK;
        if( !(USBHSD->INT_ST & RB_UIS_EP_DIR )) // SETUP/OUT Transaction
        {
            switch( endp_num )
            {
                case   DEF_UEP0:
                    if( USBHSD->UEP0_RX_CTRL & USBHS_RB_SETUP_IS )
                    {
                        /* Store All Setup Values */
                        USBHS_SetupReqType  = pUSBHS_SetupReqPak->bRequestType;
                        USBHS_SetupReqCode  = pUSBHS_SetupReqPak->bRequest;
                        USBHS_SetupReqLen   = pUSBHS_SetupReqPak->wLength;
                        USBHS_SetupReqValue = pUSBHS_SetupReqPak->wValue;
                        USBHS_SetupReqIndex = pUSBHS_SetupReqPak->wIndex;

                        len = 0;
                        errflag = 0;
                        if ( ( USBHS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                        {
                            /* usb non-standard request processing */
                            if( USBHS_SetupReqType & USB_REQ_TYP_CLASS )
                            {
                                /* Class requests */
                                switch( USBHS_SetupReqCode )
                                {
                                    case CDC_GET_LINE_CODING:
                                        pUSBHS_Descr = (uint8_t *)&Uart.Com_Cfg[ 0 ];
                                        len = 7;
                                        break;

                                    case CDC_SET_LINE_CODING:
                                        break;

                                    case CDC_SET_LINE_CTLSTE:
                                        break;

                                    case CDC_SEND_BREAK:
                                        break;

                                    default:
                                        errflag = 0xff;
                                        break;
                                }
                            }
                            else if( USBHS_SetupReqType & USB_REQ_TYP_VENDOR )
                            {
                                /* Manufacturer request */
                            }
                            else
                            {
                                errflag = 0xFF;
                            }
                            /* Copy Descriptors to Endp0 DMA buffer */
                            len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                            memcpy( USBHS_EP0_Buf, pUSBHS_Descr, len );
                            pUSBHS_Descr += len;
                        }
                        else
                        {
                            /* usb standard request processing */
                            switch( USBHS_SetupReqCode )
                            {
                                /* get device/configuration/string/report/... descriptors */
                                case USB_GET_DESCRIPTOR:
                                    switch( (uint8_t)(USBHS_SetupReqValue>>8) )
                                    {
                                        /* get usb device descriptor */
                                        case USB_DESCR_TYP_DEVICE:
                                            pUSBHS_Descr = MyDevDescr;
                                            len = DEF_USBD_DEVICE_DESC_LEN;
                                            break;

                                        /* get usb configuration descriptor */
                                        case USB_DESCR_TYP_CONFIG:
                                            /* Query current usb speed */
                                            if( USBHSD->MIS_ST == EXP_HS_SPD )   
                                            {
                                                /* High speed mode */
                                                USBHS_DevSpeed = USBHS_SPEED_HIGH;
                                                USBHS_DevMaxPackLen = DEF_USBD_HS_PACK_SIZE;
                                            }
                                            else
                                            {
                                                /* Full speed mode */
                                                USBHS_DevSpeed = USBHS_SPEED_FULL;
                                                USBHS_DevMaxPackLen = DEF_USBD_FS_PACK_SIZE;
                                            }

                                            /* Load usb configuration descriptor by speed */
                                            if( USBHS_DevSpeed == USBHS_SPEED_HIGH )
                                            {
                                                /* High speed mode */
                                                pUSBHS_Descr = MyCfgDescr_HS;
                                                len = DEF_USBD_CONFIG_HS_DESC_LEN;
                                            }
                                            else
                                            {
                                                /* Full speed mode */
                                                pUSBHS_Descr = MyCfgDescr_FS;
                                                len = DEF_USBD_CONFIG_FS_DESC_LEN;
                                            }
                                            break;

