openwch/ch564/EVT/EXAM/USB/DEVICE/SimulateCDC/User/ch564_usbhs_device.c
                                                case (DEF_UEP2 | DEF_UEP_OUT):
                                                    /* Set End-point 2 OUT STALL */
                                                    USBHSD->UEP2_RX_CTRL = ( USBHSD->UEP2_RX_CTRL & ~USBHS_UEP_R_RES_MASK ) | USBHS_UEP_R_RES_STALL;
                                                    break;

                                                case (DEF_UEP3 | DEF_UEP_IN):
                                                    /* Set End-point 3 IN STALL */
                                                    USBHSD->UEP3_TX_CTRL = ( USBHSD->UEP3_TX_CTRL & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_STALL;
                                                    break;

                                                default:
                                                    errflag = 0xFF;
                                                    break;
                                            }
                                        }
                                    }
                                    break;

                                /* This request allows the host to select another setting for the specified interface  */
                                case USB_GET_INTERFACE:
                                    USBHS_EP0_Buf[0] = 0x00;
                                    if ( USBHS_SetupReqLen > 1 )
                                    {
                                        USBHS_SetupReqLen = 1;
                                    }
                                    break;

                                case USB_SET_INTERFACE:
                                    break;

                                /* host get status of specified device/interface/end-points */
                                case USB_GET_STATUS:
                                    USBHS_EP0_Buf[0] = 0x00;
                                    USBHS_EP0_Buf[1] = 0x00;
                                    if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )
                                    {
                                        switch( (uint8_t)( USBHS_SetupReqIndex & 0xFF ) )
                                        {
                                            case (DEF_UEP2 | DEF_UEP_IN):
                                                if( ( (USBHSD->UEP2_TX_CTRL) & USBHS_UEP_T_RES_MASK ) == USBHS_UEP_T_RES_STALL )
                                                {
                                                    USBHS_EP0_Buf[ 0 ] = 0x01;
                                                }
                                                break;

                                            case (DEF_UEP2 | DEF_UEP_OUT):
                                                if( ( (USBHSD->UEP2_RX_CTRL) & USBHS_UEP_R_RES_MASK ) == USBHS_UEP_R_RES_STALL )
                                                {
                                                    USBHS_EP0_Buf[ 0 ] = 0x01;
                                                }
                                                break;

                                            case (DEF_UEP3 | DEF_UEP_IN):
                                                if( ( (USBHSD->UEP3_TX_CTRL) & USBHS_UEP_T_RES_MASK ) == USBHS_UEP_T_RES_STALL )
                                                {
                                                    USBHS_EP0_Buf[ 0 ] = 0x01;
                                                }
                                                break;

                                            default:
                                                 errflag = 0xFF;
                                                 break;
                                        }
                                    }
                                    else if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_DEVICE )
                                    {
                                          if( USBHS_DevSleepStatus & 0x01 )
                                          {
                                              USBHS_EP0_Buf[ 0 ] = 0x02;
                                          }
                                    }

                                    if ( USBHS_SetupReqLen > 2 )
                                    {
                                        USBHS_SetupReqLen = 2;
                                    }
                                    break;

                                default:
                                    errflag = 0xFF;
                                    break;
                            }
                        }

                        /* errflag = 0xFF means a request not support or some errors occurred, else correct */
                        if( errflag == 0xFF )
                        {
                            /* if one request not support, return stall */
                            USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_STALL;
                            USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_STALL;
                        }
                        else
                        {
                            /* end-point 0 data Tx/Rx */
                            if( USBHS_SetupReqType & DEF_UEP_IN )
                            {
                                /* tx */
                                len = (USBHS_SetupReqLen>DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                                USBHS_SetupReqLen -= len;
                                USBHSD->UEP0_TX_LEN = len;
                                USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
                            }
                            else
                            {
                                /* rx */
                                if( USBHS_SetupReqLen == 0 )
                                {
                                    USBHSD->UEP0_TX_LEN = 0;
                                    USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
                                }
                                else
                                {
                                    USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_ACK;
                                }
                            }
                        }
                    }
                    /* end-point 0 data out interrupt */
                    else
                    {
                        USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_RES_NAK; // clear
                        len = USBHSD->UEP0_RX_LEN;

                        /* if any processing about rx, set it here */
                        if ( ( USBHS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                        {
                            USBHS_SetupReqLen = 0;
                            /* Non-standard request end-point 0 Data download */
                            if( USBHS_SetupReqCode == CDC_SET_LINE_CODING )
                            {
                                /* Save relevant parameters such as serial port baud rate */
                                /* The downlinked data is processed in the endpoint 0 OUT packet, the 7 bytes of the downlink are, in order
                                   4 bytes: baud rate value: lowest baud rate byte, next lowest baud rate byte, next highest baud rate byte, highest baud rate byte.
                                   1 byte: number of stop bits (0: 1 stop bit; 1: 1.5 stop bit; 2: 2 stop bits).
                                   1 byte: number of parity bits (0: None; 1: Odd; 2: Even; 3: Mark; 4: Space).
                                   1 byte: number of data bits (5,6,7,8,16); */
                                Uart.Com_Cfg[ 0 ] = USBHS_EP0_Buf[ 0 ];
                                Uart.Com_Cfg[ 1 ] = USBHS_EP0_Buf[ 1 ];
                                Uart.Com_Cfg[ 2 ] = USBHS_EP0_Buf[ 2 ];
                                Uart.Com_Cfg[ 3 ] = USBHS_EP0_Buf[ 3 ];
                                Uart.Com_Cfg[ 4 ] = USBHS_EP0_Buf[ 4 ];
                                Uart.Com_Cfg[ 5 ] = USBHS_EP0_Buf[ 5 ];
                                Uart.Com_Cfg[ 6 ] = USBHS_EP0_Buf[ 6 ];
                                Uart.Com_Cfg[ 7 ] = DEF_UARTx_RX_TIMEOUT;

                                /* save bauds */
                                baudrate = USBHS_EP0_Buf[ 0 ];
                                baudrate += ((uint32_t)USBHS_EP0_Buf[ 1 ] << 8 );
                                baudrate += ((uint32_t)USBHS_EP0_Buf[ 2 ] << 16 );
                                baudrate += ((uint32_t)USBHS_EP0_Buf[ 3 ] << 24 );
                                Uart.Com_Cfg[ 7 ] = Uart.Rx_TimeOutMax;

                                /* Uart2 usb init */
                                UART2_USB_Init( );
                            }
                        }
                        else
                        {
                            /* Standard request end-point 0 Data download */
                        }

