openwch/ch564/EVT/EXAM/USB/DEVICE/SimulateCDC/User/ch564_usbhs_device.c
                        if( USBHS_SetupReqLen == 0 )
                        {
                            USBHSD->UEP0_TX_LEN  = 0;
                            USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
                        }
                    }
                    USBHSD->UEP0_RX_CTRL &= ~USBHS_UEP_ENDP_R_DONE;
                   break;

                /* end-point 2 data out interrupt */
                case   DEF_UEP2:
                   /* Endp download */
                   USBHSD->UEP2_RX_CTRL ^= USBHS_UEP_R_TOG_DATA1;

                   /* DMA address */
                   Uart.Tx_PackLen[ Uart.Tx_LoadNum ] = USBHSD->UEP2_RX_LEN;
                   Uart.Tx_LoadNum++;
                   USBHSD->UEP2_RX_DMA = (uint32_t)(uint8_t *)&UART2_Tx_Buf[ ( Uart.Tx_LoadNum * DEF_USB_HS_PACK_LEN ) ];
                   if( Uart.Tx_LoadNum >= DEF_UARTx_TX_BUF_NUM_MAX )
                   {
                       Uart.Tx_LoadNum = 0x00;
                       USBHSD->UEP2_RX_DMA = (uint32_t)(uint8_t *)&UART2_Tx_Buf[ 0 ];
                   }
                   Uart.Tx_RemainNum++;

                   /* Determine if the downlink needs to be paused */
                   if( Uart.Tx_RemainNum >= ( DEF_UARTx_TX_BUF_NUM_MAX - 2 ) )
                   {
                       USBHSD->UEP2_RX_CTRL &= ~USBHS_UEP_R_RES_MASK;
                       USBHSD->UEP2_RX_CTRL |= USBHS_UEP_R_RES_NAK;
                       Uart.USB_Down_StopFlag = 0x01;
                   }

                   USBHSD->UEP2_RX_CTRL &= ~USBHS_UEP_ENDP_R_DONE;
                   break;

               default:
                   errflag = 0xFF;
                break;
            }
        }

        else
        {
          /* data-in stage processing */
            switch ( endp_num )
            {
                /* end-point 0 data in interrupt */
                case  DEF_UEP0:
                    if( USBHS_SetupReqLen == 0 )
                    {
                        USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_ACK;
                    }
                    if ( ( USBHS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                    {
                        /* Non-standard request endpoint 0 Data upload */
                    }
                    else
                    {
                        /* Standard request endpoint 0 Data upload */
                        switch( USBHS_SetupReqCode )
                        {
                            case USB_GET_DESCRIPTOR:
                                len = USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                                memcpy(USBHS_EP0_Buf, pUSBHS_Descr, len);
                                USBHS_SetupReqLen -= len;
                                pUSBHS_Descr += len;
                                USBHSD->UEP0_TX_LEN = len;
                                USBHSD->UEP0_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                                USBHSD->UEP0_TX_CTRL = ( USBHSD->UEP0_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_ACK;
                                break;

                            case USB_SET_ADDRESS:
                                USBHSD->DEV_AD = USBHS_DevAddr;
                                break;

                            default:
                                USBHSD->UEP0_TX_LEN = 0;
                                break;
                        }
                    }

                    /* test mode */
                    if( USBHS_Test_Flag & 0x80 )
                    {
                        USB_TestMode_Deal( );
                    }
                    USBHSD->UEP0_TX_CTRL &= ~USBHS_UEP_ENDP_T_DONE;
                    break;

                /* end-point 2 data in interrupt */
                case DEF_UEP2:
                    USBHSD->UEP2_TX_CTRL = (USBHSD->UEP2_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                    USBHSD->UEP2_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                    USBHS_Endp_Busy[ DEF_UEP2 ] &= ~DEF_UEP_BUSY;
                    Uart.USB_Up_IngFlag = 0x00;

                    USBHSD->UEP2_TX_CTRL &= ~USBHS_UEP_ENDP_T_DONE;
                    break;

                /* end-point 3 data in interrupt */
                case DEF_UEP3:
                    USBHSD->UEP3_TX_CTRL = (USBHSD->UEP3_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                    USBHSD->UEP3_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                    USBHS_Endp_Busy[ DEF_UEP3 ] &= ~DEF_UEP_BUSY;

                    USBHSD->UEP3_TX_CTRL &= ~USBHS_UEP_ENDP_T_DONE;
                    break;

                default :
                    break;
            }

        }
    }

    else if( USBHSD->INT_FG & LINK_RDY_IF )
    {

#ifdef  SUPPORT_USB_HSI

            USB_HSI->CAL_CR |= HSI_CAL_EN | HSI_CAL_VLD;
            USB_HSI->CAL_CR &= ~HSI_CAL_RST;

#endif
            USBHSD->INT_FG = LINK_RDY_IF;

    }
    else if( intflag & BUS_SUSP_IF )
    {
        USBHSD->INT_FG = BUS_SUSP_IF;
        /* usb suspend interrupt processing */
        if ( USBHSD->MIS_ST & RB_UMS_SUSPEND  )
        {
            USBHS_DevSleepStatus |= 0x02;
            if( USBHS_DevSleepStatus == 0x03 )
            {
                /* Handling usb sleep here */
            }
        }
        else
        {
            USBHS_DevSleepStatus &= ~0x02;
        }

    }
    else if( intflag & BUS_REST_IF )
    {
        /* usb reset interrupt processing */
        USBHS_DevConfig = 0;
        USBHS_DevAddr = 0;
        USBHS_DevSleepStatus = 0;
        USBHS_DevEnumStatus = 0;

        USBHSD->DEV_AD = 0;
        USBHS_Device_Endp_Init( );
        USBHSD->INT_FG = BUS_REST_IF;
    }
    else
    {
        /* other interrupts */
        USBHSD->INT_FG = intflag;
    }
}

